#Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
#Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.




n = int(input('Введите количество элементов первого множества \n'))
m = int(input('Введите количество элементов второго множества \n'))

#______________________________________________________________________________________________________________

# ВАРИАНТ_1 

# list_1 = []
# list_2 = []

# for i in range(n):
#     x = int(input('Введите очередной элемент первого множества \n'))
#     list_1.append(x)
# for i in range(m):
#     y = int(input('Введите очередной элемент второго множества \n'))
#     list_2.append(y)

# set_1 = set(list_1)
# set_2 = set(list_2)

# print(set_1)
# print(set_2)

#___________________________________________________________________________________________________________________________________________

# ВАРИАНТ_2

# set_1 = set()
# set_2 = set()

# for i in range(n):
#     x = int(input('Введите очередной элемент первого множества \n'))
#     set_1.add(x)
# for i in range (m):
#     y = int(input('Введите очередной элемент второго множества \n'))
#     set_2.add(y)
# print(set_1)
# print(set_2)

#____________________________________________________________________________________________________________________________________________

# ВАРИАНТ_3

# list_1 = [i ** 3 for i in range(n)]
# list_2 = [i ** 2 for i in range(m)]
# set_1 = set(list_1)
# set_2 = set(list_2)

# print(list_1)
# print(set_1)
# print(list_2)
# print(set_2)

#_______________________________________________________________________________________________________________________________________________

# ВАРИАНТ_4

set_1 = {i ** 2 for i in range(n)}
set_2 = {(i + 1) * 3 for i in range(m)}

print(set_1)
print(set_2)

#_________________________________________________________________________________________________________________________________________________

#set_res = set_1 & set_2
set_res = set_1.intersection(set_2)
print(set_res)




